berat45/esp32s3_WebServices/esp32s3_workspace/main/ESP32_S3_Web.cpp
  Serial.println("esp32s3_Web_ReadClientParamsFromFlashAndSet(): stringSsid: "    + stringSsid + " len(stringSsid): " + stringSsid.length());
  Serial.println("esp32s3_Web_ReadClientParamsFromFlashAndSet(): stringPwd: "     + stringPwd);
  Serial.println("esp32s3_Web_ReadClientParamsFromFlashAndSet(): stringIpaddr: "  + stringIpaddr);
  Serial.println("esp32s3_Web_ReadClientParamsFromFlashAndSet(): stringGateway: " + stringGateway);
  
  /* Error check - String null check */
  if((String() == stringSsid) || (String() == stringPwd) || (String() == stringIpaddr) || (String() == stringGateway))
  {
    Serial.println("esp32s3_Web_ReadClientParamsFromFlashAndSet(): EEPROM client parameters are null!");
    return ESP32S3_RESULT_ERROR;
  }

  /* Error check - String flush check */
  if((String(" ") == stringSsid) || (String(" ") == stringPwd) || (String(" ") == stringIpaddr) || (String(" ") == stringGateway))
  {
    Serial.println("esp32s3_Web_ReadClientParamsFromFlashAndSet(): EEPROM client parameters are flushed!");
    return ESP32S3_RESULT_ERROR;
  }

  /* Write read parameters into the client parameter attributes */
  if(ESP32S3_RESULT_ERROR == esp32s3_Web_UpdateClientParameters(pWebObject, ESP32S3_PARAMETER_SSID, stringSsid))
  {
    Serial.println("esp32s3_Web_ReadClientParamsFromFlashAndSet(): SSID string cannot be updated!");
    return ESP32S3_RESULT_ERROR;
  }
  Serial.println("esp32s3_Web_ReadClientParamsFromFlashAndSet(): SSID string updated successfully!");
  
  if(ESP32S3_RESULT_ERROR == esp32s3_Web_UpdateClientParameters(pWebObject, ESP32S3_PARAMETER_PWD, stringPwd))
  {
    Serial.println("esp32s3_Web_ReadClientParamsFromFlashAndSet(): PWD string cannot be updated!");
    return ESP32S3_RESULT_ERROR;
  }
  Serial.println("esp32s3_Web_ReadClientParamsFromFlashAndSet(): PWD string updated successfully!");
  
  if(ESP32S3_RESULT_ERROR == esp32s3_Web_UpdateClientParameters(pWebObject, ESP32S3_PARAMETER_IPADDR, stringIpaddr))
  {
    Serial.println("esp32s3_Web_ReadClientParamsFromFlashAndSet(): IPADDR string cannot be updated!");
    return ESP32S3_RESULT_ERROR;
  }
  Serial.println("esp32s3_Web_ReadClientParamsFromFlashAndSet(): IPADDR string updated successfully!");
  
  if(ESP32S3_RESULT_ERROR == esp32s3_Web_UpdateClientParameters(pWebObject, ESP32S3_PARAMETER_GATEWAY, stringGateway))
  {
    Serial.println("esp32s3_Web_ReadClientParamsFromFlashAndSet(): GATEWAY string cannot be updated!");
    return ESP32S3_RESULT_ERROR;
  }  
  Serial.println("esp32s3_Web_ReadClientParamsFromFlashAndSet(): GATEWAY string updated successfully!");
  
  return ESP32S3_RESULT_OK;
}

/* Clear all flash regions */
ESP32S3_RESULT_ENUM esp32s3_Web_FlushClientParamsOnFlash(esp32s3Web_Singleton* pWebObject)
{
  String ssidNullStr     = "";
  String pwdNullStr      = "";
  String ipAddrNullStr   = "";
  String gatewayNullStr  = "";
  
  if(ESP32S3_RESULT_OK != esp32s3_Web_UpdateClientParameters(webServerSingleObject, ESP32S3_PARAMETER_SSID, ssidNullStr))
  {
    Serial.println("esp32s3_Web_FlushClientParamsOnFlash(): SSID region delete failed!");
    return ESP32S3_RESULT_ERROR;
  }
  Serial.println("esp32s3_Web_FlushClientParamsOnFlash(): SSID region deleted..!");
  
  if(ESP32S3_RESULT_OK != esp32s3_Web_UpdateClientParameters(webServerSingleObject, ESP32S3_PARAMETER_PWD, pwdNullStr))
  {
    Serial.println("esp32s3_Web_FlushClientParamsOnFlash(): PWD region deleted failed!");
    return ESP32S3_RESULT_ERROR;
  }
  Serial.println("esp32s3_Web_FlushClientParamsOnFlash(): PWD region deleted..!");
  
  if(ESP32S3_RESULT_OK != esp32s3_Web_UpdateClientParameters(webServerSingleObject, ESP32S3_PARAMETER_IPADDR, ipAddrNullStr))
  {
    Serial.println("esp32s3_Web_FlushClientParamsOnFlash(): IPADDR region deleted failed!");
    return ESP32S3_RESULT_ERROR;
  }
  Serial.println("esp32s3_Web_FlushClientParamsOnFlash(): IPADDR region deleted..!");
  
  if(ESP32S3_RESULT_OK != esp32s3_Web_UpdateClientParameters(webServerSingleObject, ESP32S3_PARAMETER_GATEWAY, gatewayNullStr))
  {
    Serial.println("esp32s3_Web_FlushClientParamsOnFlash(): GATEWAY region deleted failed!");
    return ESP32S3_RESULT_ERROR;
  }
  Serial.println("esp32s3_Web_FlushClientParamsOnFlash(): GATEWAY region deleted..!");

  esp32s3_Web_WriteClientParamsIntoFlash(webServerSingleObject);
  return ESP32S3_RESULT_OK;
}

/***********************************************/
/* Input:
 *  - *uriMsg : Address of the URI string
 * Return: 
 *  - If parse operation fails, return ESP32S3_RESULT_ERROR, ESP32S3_RESULT_OK otherwise
 *
 *  Expected URI pattern is: ssid=X&pwd=Y&ipaddr=Z&gateway=K*/
ESP32S3_RESULT_ENUM esp32s3_Web_ParseNetworkParameters(String uriMsg)
{
  unsigned int iSsid;
  unsigned int iPwd;
  unsigned int iIpaddr;
  unsigned int iGateway;
  unsigned int iEnd;
  String tempoString;

  /* Replace all + symbols with spaces */
  uriMsg.replace("+", " ");
  
  /* Find the index values of the network parameters */
  iSsid    = uriMsg.indexOf(ESP32_S3_HTML_DEFINITIONS_TAG_SSID);
  iPwd     = uriMsg.indexOf(ESP32_S3_HTML_DEFINITIONS_TAG_PWD);
  iIpaddr  = uriMsg.indexOf(ESP32_S3_HTML_DEFINITIONS_TAG_IPADDR);
  iGateway = uriMsg.indexOf(ESP32_S3_HTML_DEFINITIONS_TAG_GATEWAY);
  iEnd     = uriMsg.indexOf(ESP32_S3_HTML_DEFINITIONS_TAG_END);
  
  /* First we need to check whether the incoming message contains correct entries */
  if((uriMsg.length() == 0) || (iSsid < 0) || (iPwd < 0) || (iIpaddr < 0) || (iGateway < 0))
  {
    return ESP32S3_RESULT_ERROR;
  }

  /* Step 1 - Parse for SSID, get rValue and update class SSID attribute */
  tempoString = uriMsg.substring(iSsid+5, iPwd-1);
  Serial.println("esp32s3_Web_ParseNetworkParameters(): SSID tempostring: " + tempoString);
  if(ESP32S3_RESULT_ERROR == esp32s3_Web_UpdateClientParameters(webServerSingleObject, ESP32S3_PARAMETER_SSID, tempoString))
  {
    Serial.println("esp32s3_Web_ParseNetworkParameters(): SSID parameter write error!");
    return ESP32S3_RESULT_ERROR;
  }

  /* Flush temporary string */
  tempoString = "";

  /* Step 2 - Parse for PWD, get rValue and update class PWD attribute */
  tempoString = uriMsg.substring(iPwd+4, iIpaddr-1);
  Serial.println("esp32s3_Web_ParseNetworkParameters(): PWD tempostring: " + tempoString);
  if(ESP32S3_RESULT_ERROR == esp32s3_Web_UpdateClientParameters(webServerSingleObject, ESP32S3_PARAMETER_PWD, tempoString))
  {
    Serial.println("esp32s3_Web_ParseNetworkParameters(): PWD parameter write error!");
    return ESP32S3_RESULT_ERROR;
  }

  /* Flush temporary string */
  tempoString = "";

  /* Step 3 - Parse for IPADDR, get rValue and update class IPADDR attribute */
  tempoString = uriMsg.substring(iIpaddr+7, iGateway-1);
  Serial.println("esp32s3_Web_ParseNetworkParameters(): IPADDR tempostring: " + tempoString);
  if(ESP32S3_RESULT_ERROR == esp32s3_Web_UpdateClientParameters(webServerSingleObject, ESP32S3_PARAMETER_IPADDR, tempoString))
  {
    Serial.println("esp32s3_Web_ParseNetworkParameters(): IPADDR parameter write error!");
    return ESP32S3_RESULT_ERROR;
  }

  /* Flush temporary string */
  tempoString = "";

  /* Step 4 - Parse for GATEWAY, get rValue and update class GATEWAY attribute */
  tempoString = uriMsg.substring(iGateway+8, iEnd);
  Serial.println("esp32s3_Web_ParseNetworkParameters(): GATEWAY tempostring: " + tempoString);
  if(ESP32S3_RESULT_ERROR == esp32s3_Web_UpdateClientParameters(webServerSingleObject, ESP32S3_PARAMETER_GATEWAY, tempoString))
  {
    Serial.println("esp32s3_Web_ParseNetworkParameters(): GATEWAY parameter write error!");
    return ESP32S3_RESULT_ERROR;
  }

  /* Write all parameters into flash */
  esp32s3_Web_WriteClientParamsIntoFlash(webServerSingleObject);
  return ESP32S3_RESULT_OK;
}

/******************************************************************************************************/
/* Input:
 *  - void
 * Return: 
 *  - Error status. If AP operation fails, return ESP32S3_RESULT_ERROR, ESP32S3_RESULT_OK otherwise
 *
 *  Only get called when local network parameters (client parameters) are null. AP serves a welcome page 
 *  and an input page to the user so that user can type and submit LAN parameters.
 *  
 *  Note: This service is only for one client at a time and works in blocking manner */
/******************************************************************************************************/
ESP32S3_RESULT_ENUM esp32s3_Web_AccessPointService()
{
  ESP32S3_RESULT_ENUM apModeActive = ESP32S3_RESULT_OK;
  WiFiClient wifiRemoteClient;
  String uriMessage = "";             /* Holds incoming URI message */
  String currentLine = "";            /* Holds incoming header info (except URI message) */
  char clientMsgInBytes;
  
  Serial.println("Setting AP (Access Point)");
  /* Set AP name and null password */
  WiFi.softAP(esp32s3_webService_WirelessServerName, esp32s3_webService_WirelessServerPassword);

  IPAddress IP = WiFi.softAPIP();
   /* TODO : Remove after test starts */
  Serial.print("AP IP address: ");
  Serial.println(IP); 
  /* TODO : Remove after test ends  */

  /* Listen for incoming connections, non-blocking operation 
   * 
   * Release note: Unless delay is not applied, operation fails.
   * For more, library shall be investigated and updated if possible! */
  wifiServerObject.begin();
  while(apModeActive == ESP32S3_RESULT_OK)
  {
    while(true)
    {
      wifiRemoteClient = wifiServerObject.available(); 
      if (wifiRemoteClient)
      {
        break;
      }
      delay(ESP32S3_WEBSERVICE_WIRELESS_AP_DELAY);
    }
    Serial.println("Connection established..!");

    /* Provide AP services for the remote client */
    while(wifiRemoteClient.connected())
    {
      /* If there is a new message to read, read it in bytes */
      if(wifiRemoteClient.available())
      {
        clientMsgInBytes = wifiRemoteClient.read();
        uriMessage += clientMsgInBytes;
      
        /* We need to determine whether URI is completed by checking the value of the last client message.
        * If it is a new line command, two newline characters in a row means that's the end of the client 
        * HTTP request and request for the response */
        if(clientMsgInBytes == ESP32_S3_HTML_DEFINITIONS_NEWLINE)
        {
          if(currentLine.length() == 0)
          {
            wifiRemoteClient.println(responseMessageHeaderData);
            /* If incoming URI message contains ssid keyword, it means that this is the second
            * phase of the interface so
            * 1. Parse incoming message and get ssid, password, ip_address and gateway data 
            * 2. Return bye bye web page */
            if(uriMessage.indexOf(ESP32_S3_HTML_DEFINITIONS_TAG_SSID) >= 0)
            {

              /* Parse and set class attributes */
              esp32s3_Web_ParseNetworkParameters(uriMessage);
              /* Time to break the loop */
              apModeActive = ESP32S3_RESULT_ERROR;
              
              wifiRemoteClient.println(responseMessageFarewellData_segment1);
              wifiRemoteClient.println(responseMessageFarewellData_segment2);
              wifiRemoteClient.println(responseMessageFarewellData_segment3);
              wifiRemoteClient.println(responseMessageFarewellData_segment4);
              wifiRemoteClient.println(responseMessageFarewellData_segment5);
              wifiRemoteClient.println(responseMessageFarewellData_segment6);
            }
            /* If incoming URI message doesn't contain any ssid keyword, it means that it is the first time
            * web page request comes so
            * 1. Send the actual web page so that user can bring in network entries */
            else
            {
              wifiRemoteClient.println(responseMessagePayloadData_segment1);
              wifiRemoteClient.println(responseMessagePayloadData_segment2);
              wifiRemoteClient.println(responseMessagePayloadData_segment3);
              wifiRemoteClient.println(responseMessagePayloadData_segment4);
              wifiRemoteClient.println(responseMessagePayloadData_segment5);
              wifiRemoteClient.println(responseMessagePayloadData_segment6);
              wifiRemoteClient.println(responseMessagePayloadData_segment7);
              wifiRemoteClient.println(responseMessagePayloadData_segment8);
              wifiRemoteClient.println(responseMessagePayloadData_segment9);
              wifiRemoteClient.println(responseMessagePayloadData_segment10);
            }
          
            // The HTTP response ends with another blank line
            wifiRemoteClient.println();
            // Break out of the while loop
            break;
          }
        }
      }
      else
      {
        /* Pass */
      }
    }
    // Clear the header variable
    clientMsgInBytes = ' ';
    // Close the connection
    wifiRemoteClient.stop();
    Serial.println("Client disconnected.");
    Serial.println("");
    delay(10000);
  }
  
  return ESP32S3_RESULT_OK;
}

/****************************************************************************************************************/
/* Input:
 *  - void
 * Return: 
 *  - Error status. If station mode operation fails, return ESP32S3_RESULT_ERROR, ESP32S3_RESULT_OK otherwise
 *
 *  Processor shall enter this state after AP mode. Client LAN parameters must have gotten correctly to proceed. */
/****************************************************************************************************************/
ESP32S3_RESULT_ENUM esp32s3_Web_StationModeService()
{
  WebServer server(80);
  uint8_t SmStatusTime = 0;
  const uint8_t SmStatusTimeout = 15;
  String local_WifiName = "";
  String local_WifiPwd  = "";
  
