berat45/esp32s3_WebServices/esp32s3_workspace/main/ESP32_S3_Web.cpp
  /* Read LAN parameters */
  local_WifiName = webServerSingleObject->getClientParameterAttributes(ESP32S3_PARAMETER_SSID);
  local_WifiPwd  = webServerSingleObject->getClientParameterAttributes(ESP32S3_PARAMETER_PWD);

  /*local_WifiName = "BS Ziggo";*/     /* DEBUG: DELETE */
  /*local_WifiPwd  = "Besa4546.qXa";*/ /* DEBUG: DELETE */
  
  /* Check null parameters */
  if((local_WifiName.length() == 0) || (local_WifiPwd.length() == 0))
  {
    Serial.println("esp32s3_Web_StationModeService(): Unknown/Empty LAN parameters..!");
    return ESP32S3_RESULT_ERROR;
  }
  
  /* Set Wi-Fi mode to WIFI Station Mode */
  WiFi.mode(WIFI_STA);

  /* First configuration phase */
  WiFi.begin(local_WifiName.c_str(), local_WifiPwd.c_str());
  /* Wait for the connection */
  while (WiFi.status() != WL_CONNECTED) {
    delay(700);
    SmStatusTime++;
    if(SmStatusTimeout == SmStatusTime)
    {
      /* Conenction timeout*/
       Serial.println("esp32s3_Web_StationModeService(): Connection timeout!");
       return ESP32S3_RESULT_ERROR;
    }
    Serial.print(".");
  }

/* DEBUG: DELETE */
  Serial.println("");
  Serial.print("Connected to ");
  Serial.println(local_WifiName);
  Serial.print("IP address: ");
  Serial.println(WiFi.localIP());
/* DEBUG: DELETE */

  /* mDNS is a multicast UDP service that is used to provide local network service and host discovery. 
   * Provides low level (layer 2) network awareness */
  if (MDNS.begin("esp32")) {
    Serial.println("esp32s3_Web_StationModeService(): MDNS responder started");
  }

  /* TODO */
  /* Request type: Unknown request: When the web page does not reside on this server, handler should be run.!*/
  /* server.onNotFound(handleNotFound);*/

  /* Callback set  
   * Request type: Main page */
  server.on("/", [&]() {
      server.send(200, "text/html", activeMode_reponseMessage_payload_segment1);
    });
  
  Serial.println("HTTP server started");
  server.begin();

  while(1)
  {
    server.handleClient();
    delay(10);
  }
}


/****************************************************************************************************************/
/*
 * ESP32-S3 state machine implementation
 * 
 * **********************     
 * Config File Read State
 * **********************
 *        |        
 *        |
 *        |   
 *        V
 * ******************        ******************
 * Station Mode State -----> Access Point State
 * ******************        ******************
 *        |
 *        |
 *        |
 *        V
 * ************
 * Active State
 * ************
 * */

 /* Input:
 *  - void
 * Return: 
 *  - Error status. If station mode operation fails, return ESP32S3_RESULT_ERROR, ESP32S3_RESULT_OK otherwise
 *
 *  All function calls are handled in here. No wrapper used for interfaces. */
/****************************************************************************************************************/
ESP32S3_RESULT_ENUM esp32s3_Web_FSM()
{
  ESP32S3_WEB_FSM_STATE_ENUM fsmState;
  fsmState = ESP32S3_STATE_STARTUP;

  /* Web server shall run until server failure */
  while(fsmState != ESP32S3_STATE_OFF)
  {
    switch(fsmState)
    {
      /***********************************************************/
      /* Do all necessary initializations during the setup phase */
      /***********************************************************/
      case ESP32S3_STATE_STARTUP:
      {
        /* Initialize the serial line */
        esp32s3_web_initializeSerialLine();

        /* Initialize EEPROM */
        if(ESP32S3_RESULT_OK != esp32s3_Web_InitializeEepromInstance(ESP32S3_WEBSERVICE_EEPROM_SIZE))
        {
          Serial.println("esp32s3_Web_FSM(): Initialize EEPROM failed!");
          fsmState = ESP32S3_STATE_OFF;
        }
        else
        {
          fsmState = ESP32S3_STATE_CONTROL_CONFIG_PARAMS;
        }
        Serial.println("esp32s3_Web_FSM(): ESP32S3_STATE_STARTUP success..!");
        break;
      }

      /***********************************************************/
      /* Read and valdiate local area network parameters */
      /***********************************************************/
      case ESP32S3_STATE_CONTROL_CONFIG_PARAMS:
      {
        /* Read client parameters from Flash memory */
        if(ESP32S3_RESULT_ERROR == esp32s3_Web_ReadClientParamsFromFlashAndSet(webServerSingleObject))
        {
          Serial.println("esp32s3_Web_FSM(): EEPROM parameters cannot be read! Switching to AP mode..!");
          /* Clear all regions on Flash */
          esp32s3_Web_FlushClientParamsOnFlash(webServerSingleObject);
          fsmState = ESP32S3_STATE_AP;
        }
        else
        {
          Serial.println("esp32s3_Web_FSM(): EEPROM parameters can be read! Switching to Station mode..!");
          fsmState = ESP32S3_STATE_STATION_MODE;
        }
        Serial.println("esp32s3_Web_FSM(): ESP32S3_STATE_CONTROL_CONFIG_PARAMS success..!");
        break;
      }

      /***********************************************************/
      /* Access Point functionality */
      /***********************************************************/
      case ESP32S3_STATE_AP:
      {
        /* Wait until esp32s3_Web_AccessPointService() operation finishes */
        if(ESP32S3_RESULT_OK == esp32s3_Web_AccessPointService())
        {
          Serial.println("esp32s3_Web_FSM(): Device needs to get restarted!");
          fsmState = ESP32S3_STATE_OFF;
        }
        Serial.println("esp32s3_Web_FSM(): ESP32S3_STATE_AP success..!");
        break;
      }
      
      case ESP32S3_STATE_STATION_MODE:
      {
        Serial.println("esp32s3_Web_FSM(): ESP32S3_STATE_AP success..!");
        /* Wait until esp32s3_Web_StationModeService() operation fails */
        #warning "Infinite loop must be avoided!"
        if(ESP32S3_RESULT_ERROR == esp32s3_Web_StationModeService())
        {
          Serial.println("esp32s3_Web_FSM(): Station mode failed!");
          /* Clear all regions on Flash */
          esp32s3_Web_FlushClientParamsOnFlash(webServerSingleObject);
          fsmState = ESP32S3_STATE_OFF;
        }
        else
        {
          /* TODO */
        }
        break;
      }
      
      case ESP32S3_STATE_ACTIVE:
      {
        break;
      }
      
      case ESP32S3_STATE_OFF:
      {
        /* Pass */
        break;
      }
      
      default:
      {
        Serial.println("esp32s3_Web_FSM(): Unknown FSM state!");
        fsmState = ESP32S3_STATE_OFF;
        break;
      }      
    }
  }
  
  Serial.println("esp32s3_Web_FSM(): Please restart the device..!");
  return ESP32S3_RESULT_OK;
}








 
